<a href="https://colab.research.google.com/github/ryu-jihye/finance_python/blob/main/%EA%B8%88%EC%9C%B5%EB%8D%B0%EC%9D%B4%ED%84%B0_%ED%8C%8C%EC%9D%B4%EC%8D%AC1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [3]:
'/content/gdrive/My Drive/data/S&P 500 (^GSPC).csv'

'/content/gdrive/My Drive/data/S&P 500 (^GSPC).csv'

In [6]:
df = pd.read_csv('/content/gdrive/My Drive/data/S&P 500 (^GSPC).csv')
df.head()

         Date         Open         High  ...        Close    Adj Close      Volume
0  2019-12-20  3223.330078  3225.649902  ...  3221.219971  3221.219971  6454270000
1  2019-12-23  3226.050049  3227.780029  ...  3224.010010  3224.010010  3060610000
2  2019-12-24  3225.449951  3226.429932  ...  3223.379883  3223.379883  1296540000
3  2019-12-26  3227.199951  3240.080078  ...  3239.909912  3239.909912  2160680000
4  2019-12-27  3247.229980  3247.929932  ...  3240.020020  3240.020020  2428670000

[5 rows x 7 columns]

In [30]:
aapl_df = pd.read_csv('/content/gdrive/My Drive/data/S&P 500 (^GSPC).csv',index_col='Date', parse_dates=['Date'])
print(aapl_df.head())
print(type(aapl_df.index))
print(type(aapl_df.index[0])) #Timestamp : 데이터 결합, 데이터 분석을 용이하게 함

                   Open         High  ...    Adj Close      Volume
Date                                  ...
2019-12-20  3223.330078  3225.649902  ...  3221.219971  6454270000
2019-12-23  3226.050049  3227.780029  ...  3224.010010  3060610000
2019-12-24  3225.449951  3226.429932  ...  3223.379883  1296540000
2019-12-26  3227.199951  3240.080078  ...  3239.909912  2160680000
2019-12-27  3247.229980  3247.929932  ...  3240.020020  2428670000

[5 rows x 6 columns]
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [15]:
s1 = pd.Series([1,np.nan,3,4,5])
s2 = pd.Series([1,2,np.nan,4,5])
s3 = pd.Series([1,2,3,np.nan,5])
df = pd.DataFrame({'S1':s1,
                   'S2':s2,
                   'S3':s3,
                   }) # 각 컬럼마다 한 개의 NaN 데이터가 존재한다 NaN 데이터를 확인하는 함수는 isna(), isnull(), isin() 세 개 존재
df.head()

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [16]:
df['S1'].isna()  
# DataFrame에서 확인하려는 Series(변수)에 isna() 호출 시 NaN값 포함 여부를 True/False로 Boolean 타입으로 변환(결측치 True)

0    False
1     True
2    False
3    False
4    False
Name: S1, dtype: bool

In [17]:
df.isna()

      S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [18]:
df.isna().sum() # 결측치 몇 개 존재하는 지 한 눈에 확인

S1    1
S2    1
S3    1
dtype: int64

In [19]:
df.isin([np.nan])

      S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [20]:
df.isin([np.nan]).sum()

S1    1
S2    1
S3    1
dtype: int64

In [21]:
df.isnull()

      S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [22]:
df.isnull().sum() #df.isin()과 동일한 값 출력
# R에서는 na와 null 데이터를 다른 데이터로 구분

S1    1
S2    1
S3    1
dtype: int64

In [24]:
df.fillna(0) #fillna : 데이터프레임에 있는 NaN을 다른 값으로 채우는 함수
# pad/ffill : 앞선 행의 값을 가져옴
# bfill/backfill : 다음 행의 값을 가져옴

    S1   S2   S3
0  1.0  1.0  1.0
1  0.0  2.0  2.0
2  3.0  0.0  3.0
3  4.0  4.0  0.0
4  5.0  5.0  5.0

In [25]:
df.fillna(method='pad')

    S1   S2   S3
0  1.0  1.0  1.0
1  1.0  2.0  2.0
2  3.0  2.0  3.0
3  4.0  4.0  3.0
4  5.0  5.0  5.0

In [26]:
df.fillna(method='bfill')

    S1   S2   S3
0  1.0  1.0  1.0
1  3.0  2.0  2.0
2  3.0  4.0  3.0
3  4.0  4.0  5.0
4  5.0  5.0  5.0

In [27]:
df.dropna()
df.dropna(axis='rows') #axis : 행을 제거할지, 열을 제거할지 여부 결정
df.dropna(axis=0) # axis = 0 : 아래로 향하는 행 방향, axis = 1 : 열 방향 제거

    S1   S2   S3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [28]:
df.dropna(axis='columns')
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [34]:
aapl_df[aapl_df.isin([np.nan, np.inf, -np.inf]).any(1)]

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []